common/models/Account.php

  public static function getAccount($id){
      $model = Account::findOne($id);
---
SELECT * FROM `au_account` WHERE `id`=443