common/models/Article.php

public static function getLastArticle($cat_id = 0,$limit=5,$orderby='id desc'){
        $sql = Article::find();
        if($cat_id>0){
             $sql->where('status =:status AND cat_id =:cat_id',array(':status' =>1,':cat_id' =>$cat_id));
        }else{
             $sql->where('status =:status',array(':status' => 1));
        }
        if($limit>0) $sql->limit($limit);
        $sql->orderBy($orderby);
        $rows = $sql->all();
---
SELECT * FROM `au_article` WHERE status =1 AND cat_id =37 ORDER BY `id` LIMIT 5

  public static function getDetailArticle($id){
      //Yii::$app->language = Yii::$app->request->cookies->getValue('language');
      $model = Article::findOne($id);
---
SELECT * FROM `au_article` WHERE `id`=190