common/models/Category.php

SELECT * FROM `au_category` WHERE `id`=37
---
   public static function getDetailCategory($id){
          $model = Category::findOne($id);