common/models/Country.php

    public static function getName($id){
            $model = Country::findOne($id);
---
SELECT * FROM `en_country` WHERE `id`=211