common/models/Itemimg.php

  public static function getAllImagetypeExt($type,$ext_id){
        $result = Itemimg::find()
                ->where('type=:type AND ext_id=:ext_id AND status = 1',array(':type'=>$type,':ext_id'=>$ext_id))
                ->orderBy('create_date asc')
                ->all();
---
SELECT * FROM `en_itemimg` WHERE type='review' AND ext_id=417 AND status = 1 ORDER BY `create_date`