common/models/Menu.php

   public static function getMenu($cate_id=0,$lang='en'){
        $result = Menu::find()
                    ->where('parent_id >0 and status =:status and cate_id =:cate_id',
                            array(':status' =>1,':cate_id' =>$cate_id)
                        )
                    ->orderBy('ordering asc')
                    ->all();
---
SELECT * FROM `au_menu` WHERE parent_id >0 and status =1 and cate_id =1 ORDER BY `ordering`