common/models/Ourteam.php

public static function getListOurteam($country_id=232,$limit=0){
        $sql = Ourteam::find();
        if($country_id>0){
            $sql->where('status =:status AND country_id =:country_id',array(':status' =>1,':country_id' =>$country_id));
        }else{
            $sql->where('status =:status',array(':status' => 1));
        }
        if($limit>0) $sql->limit($limit);
        $sql->orderBy('ordering asc');
        $rows = $sql->all();
---
SELECT * FROM `en_ourteam` WHERE status =1 AND country_id =232 ORDER BY `ordering` LIMIT 12