common/models/Review.php

public static function getLastReview($limit=5,$orderby='id desc',$fields=''){
        $sql = Review::find();
        $sql->joinWith(array('account'));
        if($fields!=''){$sql->select($fields);}
        $sql->where(Review::tableName().'.status =:status',array(':status'=>1));
        if($limit>0) $sql->limit($limit);
        $sql->orderBy($orderby);
        $rows = $sql->all();
---
SELECT * FROM `au_account` WHERE `id` IN (369, 368, 367, 366, 365, 364, 363, 362, 361)