common/models/Settings.php

  public static function getDetail($id){
        return self::findOne($id);
---
SELECT * FROM `au_settings` WHERE `id`=1